[
    {
        "title": "DSC106 Profolio",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Personal Profolio Website based on HTML and JS. This is an ongoing project so it is still under development."
    },
    {
        "title": "Zoo-Seeker App",
        "year": "2022",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "An Android Application using Android Studio and Google Map API. It generates an efficient visit route according to user location and chosen “want-to-go” exhibits list in San Diego Zoo."
    },
    {
        "title": "Self-Driving Car",
        "year": "2021",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Built a self-driving car with lane detection using Raspberry Pi. Implemented QR Code recognition to perform stop and turn instruction"
    },
    {
        "title": "Health Care ChatBot",
        "year": "2024",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Cross-platform application using Expo that provides users with easy and fast access to Chatbot services."
    },
    {
        "title": "Context Encoder Reimplementation",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Pytorch training network from scratch, generates predictions on masked areas from image datasets."
    },
    {
        "title": "Quia temporibus quos facilis!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Rem repudiandae vel veniam itaque culpa at rerum, cupiditate vitae pariatur voluptatibus earum neque, eveniet nesciunt sapiente? Exercitationem amet praesentium consequatur nemo assumenda. Officia libero ipsa assumenda accusantium maxime reiciendis."
    },
    {
        "title": "Architecto accusamus non dolore?",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Maxime iste dolorem id commodi ipsum, iusto voluptas sint fugiat. Error officia neque quam laudantium, aliquam minus rem architecto consequuntur cumque labore? Neque placeat nihil eveniet molestiae dolores, consequuntur unde."
    },
    {
        "title": "Aspernatur optio perspiciatis molestiae.",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Hic nulla omnis molestias facilis quasi delectus, sint repellat asperiores sapiente harum commodi aspernatur accusamus nam mollitia repudiandae eligendi sed aut fuga vitae. Sunt totam consequatur accusantium quo nostrum delectus?"
    },
    {
        "title": "Nesciunt, delectus? A, magnam?",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Autem nihil odio ex ipsam itaque accusantium temporibus, repellendus, at assumenda illum quam vero et magnam quisquam adipisci quia corrupti quos delectus sunt. Exercitationem impedit nobis enim. Corporis, recusandae iusto."
    },
    {
        "title": "Corrupti, numquam! Cum, reprehenderit!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Omnis veritatis ducimus laboriosam esse? Repellat debitis facere eum a alias ipsa nobis harum non voluptatibus quo saepe, accusantium veniam ullam nisi eaque asperiores dolore sed culpa, et possimus aperiam?"
    },
    {
        "title": "Obcaecati maiores repellendus quisquam.",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Nobis alias vero dolore, quae sed repellat enim deserunt, omnis debitis minus, id voluptates totam. Blanditiis amet iusto doloribus quos eveniet ducimus earum atque, deserunt illum dignissimos expedita minus ullam!"
    },
    {
        "title": "Architecto placeat commodi odit!",
        "year": "2025",
        "image": "https://vis-society.github.io/labs/2/images/empty.svg",
        "description": "Amet quod, pariatur asperiores cumque, odio iste veniam aperiam impedit numquam, quis placeat fugit illo eligendi. Laborum quas deleniti cum et! Tempore, repudiandae perferendis reprehenderit porro libero ab. Enim, voluptate?"
    }
]